In [1]:
import pandas as pd
import numpy as np
import matplotlib.pyplot as plt
import seaborn as sns

In [2]:
df = pd.read_csv('titanic_train.csv')

In [3]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,S
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,C
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,S
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,S
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,S

In [4]:
df.isnull().sum()

Unnamed: 0       0
PassengerId      0
Survived         0
Pclass           0
Name             0
Sex              0
Age            177
SibSp            0
Parch            0
Ticket           0
Fare             0
Cabin          687
Embarked         2
dtype: int64

In [5]:
ports = pd.get_dummies(df.Embarked, prefix= 'Embarked')
ports.head() #As it cannot understand strings

   Embarked_C  Embarked_Q  Embarked_S
0           0           0           1
1           1           0           0
2           0           0           1
3           0           0           1
4           0           0           1

In [6]:
df = df.join(ports)
df.drop(['Embarked'], axis=1,inplace=True)

In [7]:
df.head()

,Unnamed: 0,PassengerId,Survived,Pclass,Name,Sex,Age,SibSp,Parch,Ticket,Fare,Cabin,Embarked_C,Embarked_Q,Embarked_S
0,0,1,0,3,"Braund, Mr. Owen Harris",male,22.0,1,0,A/5 21171,7.2500,NaN,0,0,1
1,1,2,1,1,"Cumings, Mrs. John Bradley (Florence Briggs Th...",female,38.0,1,0,PC 17599,71.2833,C85,1,0,0
2,2,3,1,3,"Heikkinen, Miss. Laina",female,26.0,0,0,STON/O2. 3101282,7.9250,NaN,0,0,1
3,3,4,1,1,"Futrelle, Mrs. Jacques Heath (Lily May Peel)",female,35.0,1,0,113803,53.1000,C123,0,0,1
4,4,5,0,3,"Allen, Mr. William Henry",male,35.0,0,0,373450,8.0500,NaN,0,0,1

In [8]:
df.Sex = df.Sex.map({'male':0,'female':1})

In [10]:
y = df.Survived.copy()
X = df.drop(['Survived'],axis=1)

In [11]:
X.drop(['Cabin','Ticket','PassengerId'], axis=1, inplace=True)

In [12]:
X.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 891 entries, 0 to 890
Data columns (total 11 columns):
 #   Column      Non-Null Count  Dtype
---  ------      --------------  -----
 0   Unnamed: 0  891 non-null    int64
 1   Pclass      891 non-null    int64
 2   Name        891 non-null    object
 3   Sex         891 non-null    int64
 4   Age         714 non-null    float64
 5   SibSp       891 non-null    int64
 6   Parch       891 non-null    int64
 7   Fare        891 non-null    float64
 8   Embarked_C  891 non-null    uint8
 9   Embarked_Q  891 non-null    uint8
 10  Embarked_S  891 non-null    uint8
dtypes: float64(2), int64(5), object(1), uint8(3)
memory usage: 58.4+ KB

In [13]:
X.isnull().values.any()

True

In [14]:
X[pd.isnull(X).any(axis = 1)]

,Unnamed: 0,Pclass,Name,Sex,Age,SibSp,Parch,Fare,Embarked_C,Embarked_Q,Embarked_S
5,5,3,"Moran, Mr. James",0,NaN,0,0,8.4583,0,1,0
17,17,2,"Williams, Mr. Charles Eugene",0,NaN,0,0,13.0000,0,0,1
19,19,3,"Masselmani, Mrs. Fatima",1,NaN,0,0,7.2250,1,0,0
26,26,3,"Emir, Mr. Farred Chehab",0,NaN,0,0,7.2250,1,0,0
28,28,3,"O'Dwyer, Miss. Ellen ""Nellie""",1,NaN,0,0,7.8792,0,1,0
...,...,...,...,...,...,...,...,...,...,...,...
859,859,3,"Razi, Mr. Raihed",0,NaN,0,0,7.2292,1,0,0
863,863,3,"Sage, Miss. Dorothy Edith ""Dolly""",1,NaN,8,2,69.5500,0,0,1
868,868,3,"van Melkebeke, Mr. Philemon",0,NaN,0,0,9.5000,0,0,1
878,878,3,"Laleff, Mr. Kristo",0,NaN,0,0,7.8958,0,0,1
888,888,3,"Johnston, Miss. Catherine Helen ""Carrie""",1,NaN,1,2,23.4500,0,0,1

In [15]:
X.Age.fillna(X.Age.mean(), inplace=True)

In [16]:
X.isnull().values.any()

False

In [17]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size = 0.2, random_state = 7)

In [19]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [23]:
X.drop(['Name'], axis=1, inplace=True)

In [25]:
from sklearn.model_selection import train_test_split
X_train,X_test,y_train,y_test = train_test_split(X,y, test_size = 0.2, random_state = 7)

In [27]:
from sklearn.linear_model import LogisticRegression
model = LogisticRegression()

In [29]:
import warnings
warnings.filterwarnings('ignore')

model.fit(X_train,y_train)

LogisticRegression()

In [30]:
model.score(X_train,y_train)

0.8117977528089888

In [31]:
model.score(X_test,y_test)

0.7597765363128491

In [32]:
#Decision Tree Model
from sklearn.tree import DecisionTreeClassifier
dt = DecisionTreeClassifier(random_state = 0, max_depth = 5)
dt.fit(X_train,y_train)

DecisionTreeClassifier(max_depth=5, random_state=0)

In [33]:
dt.score(X_train,y_train)

0.8539325842696629

In [34]:
prediction = dt.predict(X_test)

In [35]:
from sklearn.metrics import accuracy_score
accuracy_score(y_test, prediction)

0.7932960893854749

In [36]:
#Random Forest
from sklearn.ensemble import RandomForestClassifier
rf = RandomForestClassifier(max_depth = 5)

In [37]:
rf.fit(X_train,y_train)
rf.score(X_train,y_train)

0.8679775280898876

In [38]:
predict = rf.predict(X_test)
rf.score(X_test,y_test)

0.776536312849162